<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    A <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    Comandos para <u><b>Inserção de tuplas</b></u> <br>
        &emsp; &emsp; &emsp; &emsp; &emsp; INSERT INTO<br>
        &emsp; &emsp; &emsp; &emsp; &emsp; SELECT INTO<br>
        &emsp; &emsp; &emsp; &emsp; &emsp; COPY TO<br>
        </font>
<div align="right"><font size="1" face="arial" color="gray">17 cel</font></div>

<br>

**Objetivo:** Explorar comandos básicos da linguagem sub-linguagem de manipulaçào de dados em SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
  * Explorar o comando `INSERT INTO`
    * Variações para uma ou várias tuplas por comando
    * obtendo dados externos ou a partir de tabelas já existentes
    * Tratamento de conflitos
  * Cuidados com o desempenho de comandos de inserção
  * Explorar o comando `SELECT INTO`
  * Explorar o comando `COPY TO`

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [15]:
# Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine
from pgspecial.main import PGSpecial
from pgspecial.namedqueries import NamedQueries

# Conectar com um servidor SQL na base Alunos 15 --> Postgres.Alunos15
%reload_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/alunos15')
%sql postgresql://postgres:postgres@localhost/alunos15

<br><br>

----

<br>

Vamos também "limpar" a base de qualquer tabela que possa ter sido criada em execuções anteriores deste _notebook_:

In [16]:
%%sql
DROP TABLE IF EXISTS Professor2 CASCADE;
DROP TABLE IF EXISTS ProfSemIdade;
DROP TABLE IF EXISTS PessoasSanca;

 * postgresql://postgres:***@localhost/alunos15
Done.
Done.
Done.

[]

<br><br>

----

<br>

## 2. O Comando `INSERT INTO`

O comando <b><font size="3" face="courier" color="blue">INSERT INTO</font></b> é usado para inserir &mdash; <u>criar</u> &mdash;  tuplas em uma relação.

Veja que a relação precisa existir!

Existem dois formatos para o comando:
  * 1: Insere dados <b>externos:</b>
     * Insere <b>uma tupla</b> por comando;
     * Insere <b>várias tuplas</b> por comando;
  * Insere <b>múltiplas tuplas</b>, obtendo os dados <b>internamente</b>, a partir de dados já armazenados em outras tabelas.

<br><br>

----

<br><br>

### 2.1. Inserir uma tupla por comando

A sintaxe do comando `INSERT INTO` &nbsp; quando é preciso inserir <u>uma tupla</u> com dados externos é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
INSERT INTO $<$Tabela$>$ <br>
    &emsp; [ ($<$Lista de atributos$>$) ]<br>
    &emsp; VALUES ($<$expression$>$ | DEFAULT[, ...])<br>
    &emsp; ;</font></b>
</div><br>

Caso a <b><font size="3" face="courier" color="blue">($<$Lista de atributos$>$)</font></b> opcional não seja indicada, \
 &emsp; os valores devem ser colocados na ordem com que os atributos estão definidos na tabela.\
 &emsp; &emsp; (`CREATE TABLE` mais a sucessão de `ALTER TABLE`)<br><br>

Para ilustrar, vamos duplicar a tabela de `Professores` para poder modificá-la à vontade, \
e ver a ordem com que os atributos estão definidos:

In [20]:
%sql DROP TABLE IF EXISTS Professor2;
%sql CREATE TABLE Professor2 AS TABLE Professor;

 * postgresql://postgres:***@localhost/alunos15
Done.
 * postgresql://postgres:***@localhost/alunos15
9 rows affected.

[]

<font color="red"><b>ATENÇÃO:</b></font>\
O Comando `CREATE TABLE <tabela> AS` copia:
  * a estrutura da tabela e
  * pode copiar os dados,

  &emsp; <font color="red"><b>&starf; mas não copia as restrições de integridade. &starf;</font></b>

Então, é importante colocar as restrições necessárias logo depois da <u>criação por copia</u> da tabela.

In [21]:
%sql                                                   \
ALTER TABLE Professor2                                 \
    ADD CONSTRAINT Prof2_PK PRIMARY KEY(NNFuncional),  \
    ADD CONSTRAINT Prof2_Nome_UN UNIQUE (Nome),        \
    ALTER Nome SET NOT NULL;

 * postgresql://postgres:***@localhost/alunos15
Done.

[]

(veja que não precisamos declarar `NNFuncional` como `NOT NULL`: a restrição de chave primária faz isso)

Podemos agora "contratar" um novo professor, \
 &emsp; &starf; indicando os valores no comando `INSERT` na ordem definida na tabela:

In [22]:
%%sql
INSERT INTO Professor2
    VALUES ('Basílio', '5656', 'MS-3', 33);

SELECT * from Professor2;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
10 rows affected.

[('Ari', '1111   ', 'MS-1   ', Decimal('25')),
 ('Adao', '2222   ', 'MS-2   ', Decimal('30')),
 ('Anselmo', '3333   ', 'MS-2   ', Decimal('31')),
 ('Amalia', '8888   ', 'MS-3   ', Decimal('39')),
 ('Ana', '4444   ', 'MS-3   ', Decimal('31')),
 ('Alice', '5555   ', 'MS-3   ', Decimal('35')),
 ('Amauri', '6666   ', 'MS-3   ', Decimal('34')),
 ('Artur', '7777   ', 'MS-4   ', Decimal('41')),
 ('Adriana', '9999   ', 'MS-5   ', Decimal('45')),
 ('Basílio', '5656   ', 'MS-3   ', Decimal('33'))]


<br><br>

----

<br><br>

Podemos indicar os atributos em qualquer ordem, \
 &emsp; &starf; mas nesse caso a ordem precisa ser especificada colocando a opção
 <b><font size="3" face="courier" color="blue">($<$Lista de atributos$>$)</font></b>:

In [23]:
%%sql
INSERT INTO Professor2 (Nome,    Nivel,   NNfuncional)
                VALUES ('Bóris', 'MS-3', '5757'      );

SELECT * FROM Professor2;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
11 rows affected.

[('Ari', '1111   ', 'MS-1   ', Decimal('25')),
 ('Adao', '2222   ', 'MS-2   ', Decimal('30')),
 ('Anselmo', '3333   ', 'MS-2   ', Decimal('31')),
 ('Amalia', '8888   ', 'MS-3   ', Decimal('39')),
 ('Ana', '4444   ', 'MS-3   ', Decimal('31')),
 ('Alice', '5555   ', 'MS-3   ', Decimal('35')),
 ('Amauri', '6666   ', 'MS-3   ', Decimal('34')),
 ('Artur', '7777   ', 'MS-4   ', Decimal('41')),
 ('Adriana', '9999   ', 'MS-5   ', Decimal('45')),
 ('Basílio', '5656   ', 'MS-3   ', Decimal('33')),
 ('Bóris', '5757   ', 'MS-3   ', None)]


<br><br>

----

<br><br>

### 2.2. Inserir várias tupla por comando

A sintaxe do comando `INSERT INTO` &nbsp; quando é preciso inserir <u>várias tuplas</u> com dados externos é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
INSERT INTO $<$Tabela$>$ <br>
    &emsp; [ ($<$Lista de atributos$>$) ]<br>
    &emsp; VALUES ($<$expression$>$ | DEFAULT[, ...])<font color="teal">,<br>
    &emsp; &emsp; &emsp; &ensp; ($<$expression$>$ | DEFAULT[, ...]), ...</font><br>
    &emsp; ;</font></b>
</div>
        
Por exemplo:

In [24]:
%%sql
INSERT INTO Professor2 (Nome,       Nivel,   NNfuncional)
                VALUES ('Benedito', 'MS-3', '6767'),
                       ('Bento',    'MS-5', '8757');

SELECT * FROM Professor2;

 * postgresql://postgres:***@localhost/alunos15
2 rows affected.
13 rows affected.

[('Ari', '1111   ', 'MS-1   ', Decimal('25')),
 ('Adao', '2222   ', 'MS-2   ', Decimal('30')),
 ('Anselmo', '3333   ', 'MS-2   ', Decimal('31')),
 ('Amalia', '8888   ', 'MS-3   ', Decimal('39')),
 ('Ana', '4444   ', 'MS-3   ', Decimal('31')),
 ('Alice', '5555   ', 'MS-3   ', Decimal('35')),
 ('Amauri', '6666   ', 'MS-3   ', Decimal('34')),
 ('Artur', '7777   ', 'MS-4   ', Decimal('41')),
 ('Adriana', '9999   ', 'MS-5   ', Decimal('45')),
 ('Basílio', '5656   ', 'MS-3   ', Decimal('33')),
 ('Bóris', '5757   ', 'MS-3   ', None),
 ('Benedito', '6767   ', 'MS-3   ', None),
 ('Bento', '8757   ', 'MS-5   ', None)]


<br><br>

----

<br><br>

### 2.3. Inserir tuplas em uma tabela a partir de dados internos

Existe um formato que corresponde à 2' opção:\
&emsp; Inserir múltiplas tuplas a partir de dados já disponíveis internamente à Base de dados

A sintaxe do comando `INSERT INTO` para <u>inserir tuplas com dados internos</u> é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
INSERT INTO $<$Tabela$>$ <br>
    &emsp; [ ($<$Lista de atributos$>$) ]<br>
    &emsp; VALUES ($<$expression$>$ | DEFAULT[, ...]),<br>
    &emsp; &emsp; &emsp; &ensp; ($<$expression$>$ | DEFAULT[, ...]), ...<br>
    &emsp; ;</font></b>
</div><br><br>
        
Por exemplo:\
<i>Criar uma nova tabela para guardar os dados de todas as pessoas de `São Carlos` definidas na base de dados:</i>
  * <i>Todos os `Alunos` que são de `São Carlos` e</i>
  * <i>Todos os `Professores`, pois como eles não têm o atributo `Cidade`, não sabemos de onde eles são.\
     &emsp; &emsp; &emsp; <font size="5">&#9758;</font>Então assumimos que sejam de `São carlos` porque eles são professores daqui!</i>

Veja que o comando `INSERT INTO` requer uma tabela que já existe.\
 &emsp; &starf; Portanto, é necessário criar essa tabela antes de colocar tuplas nela.

In [25]:
%%sql
DROP TABLE IF EXISTS PessoasSanca;      -- Cria a tabela PessoasSanca vasia
CREATE TABLE PessoasSanca AS
    (SELECT Nome, Idade, '':: VARCHAR(10) AS OQue  -- Colocamos "OQue" para depois diferenciarmos quem é aluno ou professor
        FROM Aluno)
    WITH NO DATA;

INSERT INTO PessoasSanca                -- Coloca os Alunos de São Carlos
    SELECT Nome, Idade, 'Aluno'
        FROM Aluno
        WHERE Cidade LIKE 'S%Carlos';   -- Não importa com São está escrito: SCarlos, S Carlos, São Carlos, SaoCarlos, etc.

INSERT INTO PessoasSanca                -- Coloca os professores, pois não sabemos quem é de SCarlos
    SELECT Nome, Idade, 'Professor'
        FROM Professor2;

SELECT * FROM PessoasSanca;

 * postgresql://postgres:***@localhost/alunos15
Done.
Done.
4 rows affected.
13 rows affected.
17 rows affected.

[('Carlos', Decimal('21'), 'Aluno'),
 ('Celso', Decimal('22'), 'Aluno'),
 ('Catarina', Decimal('23'), 'Aluno'),
 ('Celina', Decimal('27'), 'Aluno'),
 ('Ari', Decimal('25'), 'Professor'),
 ('Adao', Decimal('30'), 'Professor'),
 ('Anselmo', Decimal('31'), 'Professor'),
 ('Amalia', Decimal('39'), 'Professor'),
 ('Ana', Decimal('31'), 'Professor'),
 ('Alice', Decimal('35'), 'Professor'),
 ('Amauri', Decimal('34'), 'Professor'),
 ('Artur', Decimal('41'), 'Professor'),
 ('Adriana', Decimal('45'), 'Professor'),
 ('Basílio', Decimal('33'), 'Professor'),
 ('Bóris', None, 'Professor'),
 ('Benedito', None, 'Professor'),
 ('Bento', None, 'Professor')]


<br><br>

----

<br><br>

## 4. Sintaxe geral do comando `INSERT INTO`

A sintaxe geral do comando `INSERT INTO` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
INSERT INTO $<$Tabela$>$ [AS $<$Alias$>$] [ ($<$nome$>$[, ...]) ]<br>
    &emsp; &emsp; &emsp; {DEFAULT VALUES <br>
    &emsp; &emsp; &emsp; &emsp; | $<$query$>$<br>
    &emsp; &emsp; &emsp; &emsp; | VALUES ({$<$expressão$>$ |DEFAULT}[, ...] )[, ...]}<br>
    &emsp; &emsp; &emsp; [ON CONFLICT [$<$atr_conflito$>$] $<$Ação$>$ ]<br>
    &emsp; &emsp; &emsp; [RETURNING * | $<$expressão> [[AS] $<$atr_nome$>$][, ...] &emsp; ]
    </font></b></div>

onde:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
$<$atr_conflito$>$ = ($<$index_atr_nome$>$)<br>
    &emsp; &emsp; [ WHERE $<$predicado$>$]<br>
    &emsp; &emsp; ON CONSTRAINT $<$constraint_name$>$
    </font></b></div>

<br>e<br>

<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
    $<$Ação$>$ = <u>DO NOTHING </u><br>
    &emsp; &emsp; | DO UPDATE SET <br>
    &emsp; &emsp; &emsp; &emsp; {$<$Atributo$>$ = {$<$Expressão$>$ | DEFAULT }<br>
    &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; | $(<$Atributo$>$[,...]) = ROW( $<$Expressão$>$ | DEFAULT )<br>
    &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; | $(<$Atributo$>$[,...]) = $<$Sub-Select$>$)<br>
    &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; }[, ...]<br>
    &emsp; &emsp; [WHERE $<$Condition$>$]<br>
   &emsp; [<u>NULL</u> | NOT NULL]
   &emsp; [DEFAULT $<$Valor$>$]   &emsp;  &emsp; <font color="black">-- DEFAULT NULL</font>
</font></b></div>

<br><br>
       
Para um exemplo de tratamento de conflito,\
<i>Suponha fizemos uma tentativa inserir uma tupla com chave repetida.</i>

Normalmente, isso <font color="orange">geraria um erro!</font>

Podemos suprimir o erro indicando uma ação para não fazer nada: `DO NOTHING` (o padrão):
  * se não houver conflito, o comando é executado normalmente,
  * se houver conflito, então não faz nada: a tupla não é inserida e também não gera erro.

In [26]:
%%sql
INSERT INTO Professor2 (Nome, Nivel, NNfuncional)
    VALUES ('Brito', 'MS-3', '6767'),               ---> já existe um professor com NNFuncional 6767
           ('Brígido', 'MS-3', '6768')              ---> Não existe um professor com NNFuncional 6768
    ON CONFLICT (NNfuncional) DO NOTHING -- Padrão
    RETURNING *;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[('Brígido', '6768   ', 'MS-3   ', None)]

Vamos ver como ficaram os `professores`:

In [27]:
%%sql
SELECT * FROM Professor2;

 * postgresql://postgres:***@localhost/alunos15
14 rows affected.

[('Ari', '1111   ', 'MS-1   ', Decimal('25')),
 ('Adao', '2222   ', 'MS-2   ', Decimal('30')),
 ('Anselmo', '3333   ', 'MS-2   ', Decimal('31')),
 ('Amalia', '8888   ', 'MS-3   ', Decimal('39')),
 ('Ana', '4444   ', 'MS-3   ', Decimal('31')),
 ('Alice', '5555   ', 'MS-3   ', Decimal('35')),
 ('Amauri', '6666   ', 'MS-3   ', Decimal('34')),
 ('Artur', '7777   ', 'MS-4   ', Decimal('41')),
 ('Adriana', '9999   ', 'MS-5   ', Decimal('45')),
 ('Basílio', '5656   ', 'MS-3   ', Decimal('33')),
 ('Bóris', '5757   ', 'MS-3   ', None),
 ('Benedito', '6767   ', 'MS-3   ', None),
 ('Bento', '8757   ', 'MS-5   ', None),
 ('Brígido', '6768   ', 'MS-3   ', None)]

<br>  

Outra alternativa, é executar uma atualização da tabela ao inves de uma inserção.

Por exemplo:\
<i>Suponha que estamos inserindo um professor titular (`Nivel='MS-6'`)\
 &emsp; &emsp; Se ele já existir (considerando seu `NUSP`), talvés com outro `Nivel`, somente atualiza o `Nivel`,\
 &emsp; &emsp; mantendo os demais atributos.</i>

In [28]:
%%sql
INSERT INTO Professor2 (Nome, Nivel, NNfuncional)
    VALUES ('Benedito', 'MS-6', '6767')               ---> já existe um professor com NNFuncional 6767
    ON CONFLICT (NNfuncional) DO UPDATE 
        SET Nivel = EXCLUDED.Nivel
      WHERE Professor2.Nome = EXCLUDED.Nome;

SELECT * FROM PRofessor2;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
14 rows affected.

[('Ari', '1111   ', 'MS-1   ', Decimal('25')),
 ('Adao', '2222   ', 'MS-2   ', Decimal('30')),
 ('Anselmo', '3333   ', 'MS-2   ', Decimal('31')),
 ('Amalia', '8888   ', 'MS-3   ', Decimal('39')),
 ('Ana', '4444   ', 'MS-3   ', Decimal('31')),
 ('Alice', '5555   ', 'MS-3   ', Decimal('35')),
 ('Amauri', '6666   ', 'MS-3   ', Decimal('34')),
 ('Artur', '7777   ', 'MS-4   ', Decimal('41')),
 ('Adriana', '9999   ', 'MS-5   ', Decimal('45')),
 ('Basílio', '5656   ', 'MS-3   ', Decimal('33')),
 ('Bóris', '5757   ', 'MS-3   ', None),
 ('Bento', '8757   ', 'MS-5   ', None),
 ('Brígido', '6768   ', 'MS-3   ', None),
 ('Benedito', '6767   ', 'MS-6   ', None)]

<br><br>

----

<br><br>

## 5. Cuidados com o desempenho ao inserir tuplas

O comando `INSERT INTO` apresenta poucas oportunidades de otimização automática pelo "<i>SQL planner</i>" dos SGBD.\
 &emsp;	Portanto, alguns cuidados devem ser tomados na modelagem das aplicações. \
 &emsp;	Entre elas: 
  * A <u>inserção de múltiplas tuplas</u> num mesmo comando \`INSERT` evita a necessidade de recompilação de múltiplos comandos\
      &emsp; e reduz a sobrecarga na rede e as conexões inter-processos.
  * Cuidado com a <u>declaração de chaves candidatas:</u> cada restrição \`PRIMARY KEY` e `UNIQUE`\
      &emsp; requer acessar o índice correspondente para garantir a unicidade.
  * Cuidado com a <u>declaração de chaves estrangeiras:</u> além de acessar o próprio índice, \
     &emsp; cada atualização na tabela requer acessar a tabela referenciada.
  * Cuidado com a <u>declaração de índices:</u> índices agilizam a busca,\
     &emsp; mas prejudica as atualizações, especialmente comandos `INSERT`, já que os índices praticamente não o ajudam.

<br><br>

----

<br><br>

## 6. O Comando `SELECT INTO`

Uma variação de todos os outros comandos da DML permite <b><u>inserir</u></b> o resultado da consulta em uma tabela.\
Naturalmente esse é o caso também do comando `SELECT`.

A sintaxe geral do comando `SELECT INTO` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
SELECT $<$Lista_Atrib$>$ INTO  $<$Tabela$>$ <br>
    &emsp; FROM ...<br>
    &emsp; ;</font></b>
</div>

(esse comando é equivalente ao `CREATE TABLE AS`, embora aquele seja preferível.)

Veja que:\
quando a cláusula <b><font size="3" face="courier" color="blue">($<$Lista de atributos$>$)</font></b> é especificada:
  * A tabela $<$Tabela$>$ onde o resultado sera colocado <u>é criada no comando,</u> portanto não pode existir anteriormente.
  * Os nomes e tipos dos atributos são preservados,\
     &emsp; possivelmente usando os `aliases` e `casts` colocados na cláusula `SELECT`.
  * O resultado passa a ser apenas armazenado na tabela, não retorna mais para o cliente.
  * Todas as opções do comando `SELECT` continuam válidas.

<br><br>

Por exemplo:\
<i>Colocar em uma tabela todos os professores cuja idade está nula\
  &emsp; &emsp; colocando o número do professor como sendo do tipo inteiro e\
   &emsp; &emsp; renomeando o atributo `Nome` para `NomeProf`:</i>

In [29]:
%%sql
DROP TABLE IF EXISTS ProfSemIdade;
SELECT NNFuncional::INT, Nome AS NomeProf, Nivel
    INTO ProfSemIdade
    FROM Professor2
    WHERE Idade IS NULL;

SELECT * FROM ProfSemIdade;

 * postgresql://postgres:***@localhost/alunos15
Done.
4 rows affected.
4 rows affected.

[(5757, 'Bóris', 'MS-3   '),
 (8757, 'Bento', 'MS-5   '),
 (6768, 'Brígido', 'MS-3   '),
 (6767, 'Benedito', 'MS-6   ')]


<br><br>

----

<br><br>

## 7. O comando `COPY`

O comando `COPY` permite transferir dados entre uma `Tabela` e um `Arquivo do Sistema Operacional`.

Ele não é padronizado em SQL, mas a maioria dos SGBDR disponibilizam um comando semelhante:\
 &emsp; o Comando <b><font size="3" face="courier" color="blue">COPY</font></b>,\
 &emsp; &emsp;seguindo uma sintaxe _relativamente_ padrão.

Existem duas variações:
  * <b>Ler<> de um arquivo para uma tabela: <b><font size="3" face="courier" color="blue">COPY FROM</font></b>, e
  * <b>Escrever</b> de uma tabela em um arquivo: <b><font size="3" face="courier" color="blue">COPY TO</font></b>.

<br>

A sintaxe geral do comando `Copy` em &nbsp; <img src="Figuras/Postgres.png" width=90> é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
COPY $<$tabela$>$ [ ($<$coluna$>$[, ...]) ]<br>
    &emsp;  &emsp;  { FROM {'$<$filename$>$' | STDIN} | PROGRAM '$<$Comando$>$'<br>
    &emsp;  &emsp;       | ($<$query$>$)   TO {'$<$filename$>$' | STDOUT}<br>
    &emsp;  &emsp;     }
    &emsp; [ [WITH] ($<$option$>$) ]<br>
    &emsp; ;</font></b></div>
onde <b><font size="3" face="courier" color="blue">$<$option$>$</font></b> é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
    &emsp;  &emsp;  &emsp;  FORMAT [TEXT | BINARY | CSV]<br>
    &emsp;  &emsp;  &emsp;  [DELIMITER $<$'delimiter'$>$]  &nbsp;   --  tab in text format, comma in CSV<br>
    &emsp;  &emsp;  &emsp;  [NULL  $<$'null string'$>$]    &emsp; &nbsp; --  \N (backslash-N) in text format,  unquoted empty string in CSV <br>
    &emsp;  &emsp;  &emsp;  [HEADER $<$Boolean$>$ | MATCH]   &nbsp;-- false <br>
    &emsp;  &emsp;  &emsp;  [QUOTE [AS] $<$'quote'$>$]  &emsp;  &emsp; -- "<br>
    &emsp;  &emsp;  &emsp;  [ESCAPE [AS] $<$'escape'$>$]  &emsp;&nbsp;  -- same as QUOTE<br>
    &emsp;  &emsp;  &emsp;  [FORCE NOT NULL $<$column$>$ [, ...] ]<br>
    &emsp;  &emsp;  &emsp;  [ENCODING $<$encode$>$]<br>
</div>


<br><br>

----

<br><br>

Em geral, um arquivo pode ser lido para o SGBD usando os seguintes passos:
   1) Obter a tabela deve ser obtida e preparada.
   1) Criar a tabela onde os dados vão ser lidos.\
      &emsp;  Nota: Ela não precisa estar vasia, pois os novos dados lidos podem ser acrescentados aos que já exisem.
   1) Ler os dados para a tabela.
   1) Opcional: Corrigir os dados para o formato necessário.


<br><br>

----

<br><br>

Exemplo:\
<i><b>Ler a tabela</b> do Censo de 2022 para a\
<b>População Residente, por cor segundo o sexo</b> das cidades brasileiras</i>.

<br>

__Passo 1:__<br>
A tabela deve ser obtida no _site_ do __IBGE__ em: &emsp;\
 &emsp; <a href="https://sidra.ibge.gov.br/Tabela/9606/">https://sidra.ibge.gov.br/Tabela/9606/ como Tabela 9606</a>

A tabela vem com algumas linhas que são comentários (não dados).\
Essas linhas devem ser removidas (por exemplo com um editor de textos)

__Passo 2:__<br>
Criar uma tabela intermediária `PopCorSexo`em:

In [30]:
%%sql
DROP TABLE IF EXISTS PopCorSexo CASCADE;
CREATE TABLE PopCorSexo (
  Municipio TEXT NOT NULL,
  Idade TEXT,
  Populacao INT,     -- População Total
  Homens INT,        -- Total Homens
  Mulheres INT,      -- Total Mulheres
  BrTotal INT,       -- Total Brancos
  BrHomens INT,      -- Total Homens Brancos
  BrMulheres INT,    -- Total Mulheres Brancos
  PrTotal INT,       -- Total Pretos
  PrHomens INT,      -- Total Homens Pretos
  PrMulheres INT,    -- Total Mulheres Pretos
  AmTotal INT,       -- Total Amarelos
  AmHomens INT,      -- Total Homens Amarelos
  AmMulheres INT,    -- Total Mulheres Amarelos
  PaTotal INT,       -- Total Pardos
  PaHomens INT,      -- Total Homens Pardos
  PaMulheres INT,    -- Total Mulheres Pardos
  InTotal INT,       -- Total Indígenas
  InHomens INT,      -- Total Homens Indígenas
  InMulheres INT     -- Total Mulheres Indígenas
  );

 * postgresql://postgres:***@localhost/alunos15
Done.
Done.

[]

__Passo 3:__<br>
Com a tabela criada, os dados podem ser lidos com um comando `COPY FROM`:

In [31]:
%%sql
COPY PopCorSexo
    FROM 'E:\SolE\Databases\Dados\Cidades-BR\IBGE\Censo22\Tabela9606.csv' 
        WITH (FORMAT CSV, 
              DELIMITER E';', 
              ENCODING 'UTF8',
              NULL '',
              QUOTE '"', HEADER true);

 * postgresql://postgres:***@localhost/alunos15
(psycopg2.errors.UndefinedFile) could not open file "E:\SolE\Databases\Dados\Cidades-BR\IBGE\Censo22\Tabela9606.csv" for reading: No such file or directory
HINT:  COPY FROM instructs the PostgreSQL server process to read a file. You may want a client-side facility such as psql's \copy.

[SQL: COPY PopCorSexo
    FROM 'E:\SolE\Databases\Dados\Cidades-BR\IBGE\Censo22\Tabela9606.csv'
        WITH (FORMAT CSV,
              DELIMITER E';',
              ENCODING 'UTF8',
              NULL '',
              QUOTE '"', HEADER true);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

__Passo 4:__<br>
Com a tabela criada, podemos reformatar a tabela e os atributos para deixá-la da maneira que queremos
.

<br>

Neste caso, vamos copiar a tabela para uma outra chamada `BRCid_PopCorSexo`:
 * Desmembrando o atributo `Municipio`, que vem no formato `cidade(UF)` para:
     * Um atributo `Municipio` com o nome da cidade, e
     * Um atributo `UF` com a sigla do estado.
  * Eliminar o atributo `Idade`, porque ele não foi baixado do __IBGE__.
  * A seguir apagamos a tabela temporária `PopCorSexo`.

(note que alternativamente, poderiamos modificar a mesma tabela original com comandos `ALTER TABLE`)

Isso pode ser feito com o comando:

In [32]:
%%sql
DROP TABLE IF EXISTS BRCid_PopCorSexo CASCADE;
SELECT SubString(Municipio, '(.+) \(')::TEXT            Municipio,
       SubString(Municipio, '\((..)\)')::CHAR(2)::TEXT  UF,
       Populacao, Homens, Mulheres,
	   BrTotal, BrHomens, BrMulheres,
	   PrTotal, PrHomens, PrMulheres,
	   AmTotal, AmHomens, AmMulheres,
	   PaTotal, PaHomens, PaMulheres,
	   InTotal, InHomens, InMulheres
    INTO BRCid_PopCorSexo
	FROM PopCorSexo;

DROP TABLE PopCorSexo;

 * postgresql://postgres:***@localhost/alunos15
Done.
0 rows affected.
Done.

[]

Com a tabela preparada, podemos explorar rapidamente seu conteúdo:

In [33]:
%sql Quantas <<                                         \
SELECT UF, Count(*) NN_Cidades,                          \
       to_char(Sum(Populacao), '999G999G999') Populacao,  \
       to_char(Sum(Homens),    '999G999G999') NN_Homens,   \
       to_char(Sum(Mulheres),  '999G999G999') NN_Mulheres,  \
       Round(100.*Sum(Homens)/Sum(Populacao),2) Prop_Homens  \
    FROM BRCid_PopCorSexo   \
    GROUP BY UF              \
    ORDER BY UF;

%sql Tuplas <<                                      \
SELECT municipio, uf, Populacao,                    \
          100*homens/Populacao PCT_Homens,          \
          100*mulheres/Populacao PCT_Mulheres,      \
          100*BrTotal/Populacao PCT_Brancos,        \
          100*PrTotal/Populacao PCT_Pretos,         \
          100*AmTotal/Populacao PCT_Amarelos,       \
          100*PaTotal/Populacao PCT_Pardos,         \
          100*InTotal/Populacao PCT_Indígenas"      \
    FROM BRCid_PopCorSexo                           \
    ORDER BY Populacao DESC                         \
    LIMIT 10;

print(Quantas,'\n\n', Tuplas,sep='')

 * postgresql://postgres:***@localhost/alunos15
0 rows affected.
Returning data to local variable Quantas
 * postgresql://postgres:***@localhost/alunos15
(psycopg2.errors.SyntaxError) unterminated quoted identifier at or near "" FROM BRCid_PopCorSexo ORDER BY Populacao DESC LIMIT 10;"
LINE 1: ...ao PCT_Pardos, 100*InTotal/Populacao PCT_Indígenas" FROM BRC...
                                                             ^

[SQL: SELECT municipio, uf, Populacao, 100*homens/Populacao PCT_Homens, 100*mulheres/Populacao PCT_Mulheres, 100*BrTotal/Populacao PCT_Brancos, 100*PrTotal/Populacao PCT_Pretos, 100*AmTotal/Populacao PCT_Amarelos, 100*PaTotal/Populacao PCT_Pardos, 100*InTotal/Populacao PCT_Indígenas" FROM BRCid_PopCorSexo ORDER BY Populacao DESC LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/20/f405)

NameError: name 'Tuplas' is not defined

<br><br>

----

<br><br>
<font size="4" color="blue" font=Verdana><b>Conclusão</b></font>

Os comandos apresentados `"CRIAM"` novas tuplas em uma tabela:<br>
 &emsp; `INSERT INTO`<br>
 &emsp; `SELECT INTO`<br>
 &emsp; `COPY TO`

Podemos agora remover as tabelas que foram usadas nos comandos-exemplo:

In [34]:
%%sql
DROP TABLE IF EXISTS Professor2 CASCADE;
DROP TABLE IF EXISTS ProfSemIdade;

 * postgresql://postgres:***@localhost/alunos15
Done.
Done.

[]


<br><br>

----

<br><br>

<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    A <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    <u>Comandos para <b>Inserção de Tuplas</b></u> 
    </font>